export const treeData = [
  {
    title: "Приобское",
    key: "0-0",
    children: [
      {
        title: "192",
        key: "0-0-0",
        children: [
          {
            title: "9500",
            key: "0-0-0-0",
            children: [{ title: "1", key: "0-0-0-0-0" }],
          },
          {
            title: "9501",
            key: "0-0-0-1",
            children: [{ title: "1", key: "0-0-0-1-0" }],
          },
          {
            title: "9502",
            key: "0-0-0-2",
            children: [{ title: "1", key: "0-0-0-2-0" }],
          },
        ],
      },
      {
        title: "193",
        key: "0-0-1",
      },
      {
        title: "194",
        key: "0-0-2",
      },
    ],
  },
  {
    title: "Суторминское",
    key: "0-1",
  },
  {
    title: "Самотлорское",
    key: "0-2",
  },
  {
    title: "Ромашкинское",
    key: "0-3",
  },
  {
    title: "Повховское",
    key: "0-4",
  },
];

export const treeOperations = [
  {
    key: "0-1",
    title: "Бурение",
    children: [
      { key: "0-1-1", title: "Бурение" },
      { key: "0-1-2", title: "Отбор керна" },
      { key: "0-1-3", title: "КНБК" },
    ],
  },
  { key: "0-2", title: "СПО" },
  { key: "0-3", title: "Наращивание" },
  { key: "0-4", title: "Расширение" },
  {
    key: "0-5",
    title: "Крепление",
    children: [
      { key: "0-5-1", title: "ПЗР" },
      { key: "0-5-2", title: "Промывка" },
      { key: "0-5-3", title: "Спуск колонны" },
      { key: "0-5-4", title: "Цементирование" },
      { key: "0-5-5", title: "Активация оснастки" },
      { key: "0-5-6", title: "ОЗЦ" },
      { key: "0-5-7", title: "Оборудование устья" },
      { key: "0-5-8", title: "Прочие работы" },
    ],
  },
  {
    key: "0-6",
    title: "Вспом. работы",
    children: [
      { key: "0-6-1", title: "ПЗР" },
      { key: "0-6-2", title: "Обработка раствора" },
      { key: "0-6-3", title: "Проработка" },
      { key: "0-6-4", title: "Снятие замеров" },
      { key: "0-6-5", title: "Промывка" },
      { key: "0-6-6", title: "Прокачка пачки" },
      { key: "0-6-7", title: "Тест на приток" },
      { key: "0-6-8", title: "Монтаж ПВО" },
      { key: "0-6-9", title: "Демонтаж ПВО" },
      { key: "0-6-10", title: "Монтаж ФА" },
      { key: "0-6-11", title: "Демонтаж ФА" },
      { key: "0-6-12", title: "Фрезерование окна" },
      { key: "0-6-13", title: "Разбуривание НЦС" },
      { key: "0-6-14", title: "Разбуривание оснастки" },
      { key: "0-6-15", title: "Разбуривание ЦК" },
      { key: "0-6-16", title: "Опрессовка" },
      { key: "0-6-17", title: "ГИС(на кабеле)" },
      { key: "0-6-18", title: "ГИС(на трубах)" },
      { key: "0-6-19", title: "Ориентирование КО" },
      { key: "0-6-20", title: "УТЗ" },
      { key: "0-6-21", title: "Чистка ЦСГО/ЕБ" },
      { key: "0-6-22", title: "Прочие работы" },
    ],
  },
  {
    key: "0-7",
    title: "Ремонт",
    children: [
      {
        key: "0-7-1",
        title: "ОГМ",
        children: [
          { key: "0-7-1-1", title: "БЛ" },
          { key: "0-7-1-2", title: "БН" },
          { key: "0-7-1-3", title: "ВСП" },
          { key: "0-7-1-4", title: "Бур. рукав" },
          { key: "0-7-1-5", title: "Гидравлика" },
          { key: "0-7-1-6", title: "ДЭС" },
          { key: "0-7-1-7", title: "Бур. ключ" },
          { key: "0-7-1-8", title: "ПВО" },
          { key: "0-7-1-9", title: "Перетяжка Т/К" },
          { key: "0-7-1-10", title: "Сист. очистки" },
        ],
      },

      {
        key: "0-7-2",
        title: "ОГТ",
        children: [
          { key: "0-7-2-1", title: "Бур. инстр." },
          { key: "0-7-2-2", title: "КНБК" },
          { key: "0-7-2-3", title: "Хвостовик" },
          { key: "0-7-2-4", title: "Цементаж" },
          { key: "0-7-2-5", title: "СПО" },
          { key: "0-7-2-6", title: "Прихват" },
        ],
      },

      {
        key: "0-7-3",
        title: "ОГЭ",
        children: [
          { key: "0-7-1-1", title: "ВСП" },
          { key: "0-7-1-2", title: "ДЭС" },
          { key: "0-7-1-3", title: "КИП" },
          { key: "0-7-1-4", title: "Котельная" },
          { key: "0-7-1-5", title: "Оборудование 6кВ" },
          { key: "0-7-1-6", title: "Кабель" },
          { key: "0-7-1-7", title: "Коммутация" },
          { key: "0-7-1-8", title: "Частотник" },
          { key: "0-7-1-9", title: "Электродвигатель" },
        ],
      },

      {
        key: "0-7-4",
        title: "ББ",
        children: [
          { key: "0-7-1-1", title: "ВСП" },
          { key: "0-7-1-2", title: "БН" },
          { key: "0-7-1-3", title: "БЛ" },
          { key: "0-7-1-4", title: "Бур. ключ" },
          { key: "0-7-1-5", title: "ЦСГО" },
          { key: "0-7-1-6", title: "ДЭС" },
          { key: "0-7-1-7", title: "ЕНВ" },
        ],
      },

      { key: "0-7-5", title: "МТО" },
      { key: "0-7-6", title: "ЦИТС" },
    ],
  },
  {
    key: "0-8",
    title: "НСАД",
    children: [
      {
        key: "0-8-1",
        title: "ОГМ",
        children: [
          { key: "0-8-1-1", title: "БЛ" },
          { key: "0-8-1-2", title: "БН" },
          { key: "0-8-1-3", title: "ВСП" },
          { key: "0-8-1-4", title: "Бур. рукав" },
          { key: "0-8-1-5", title: "Гидравлика" },
          { key: "0-8-1-6", title: "ДЭС" },
          { key: "0-8-1-7", title: "Бур. ключ" },
          { key: "0-8-1-8", title: "ПВО" },
          { key: "0-8-1-9", title: "Перетяжка Т/К" },
          { key: "0-8-1-10", title: "Сист. очистки" },
        ],
      },

      {
        key: "0-8-2",
        title: "ОГТ",
        children: [
          { key: "0-8-2-1", title: "Бур. инстр." },
          { key: "0-8-2-2", title: "КНБК" },
          { key: "0-8-2-3", title: "Хвостовик" },
          { key: "0-8-2-4", title: "Цементаж" },
          { key: "0-8-2-5", title: "СПО" },
          { key: "0-8-2-6", title: "Прихват" },
        ],
      },

      {
        key: "0-8-3",
        title: "ОГЭ",
        children: [
          { key: "0-8-1-1", title: "ВСП" },
          { key: "0-8-1-2", title: "ДЭС" },
          { key: "0-8-1-3", title: "КИП" },
          { key: "0-8-1-4", title: "Котельная" },
          { key: "0-8-1-5", title: "Оборудование 6кВ" },
          { key: "0-8-1-6", title: "Кабель" },
          { key: "0-8-1-7", title: "Коммутация" },
          { key: "0-8-1-8", title: "Частотник" },
          { key: "0-8-1-9", title: "Электродвигатель" },
        ],
      },

      {
        key: "0-8-4",
        title: "ББ",
        children: [
          { key: "0-8-1-1", title: "ВСП" },
          { key: "0-8-1-2", title: "БН" },
          { key: "0-8-1-3", title: "БЛ" },
          { key: "0-8-1-4", title: "Бур. ключ" },
          { key: "0-8-1-5", title: "ЦСГО" },
          { key: "0-8-1-6", title: "ДЭС" },
          { key: "0-8-1-7", title: "ЕНВ" },
        ],
      },

      { key: "0-8-5", title: "МТО" },
      { key: "0-8-6", title: "ЦИТС" },
    ],
  },

  {
    key: "0-9",
    title: "Заказчик",
    children: [
      { key: "0-9-1", title: "Заказчик" },
      {
        key: "0-9-2",
        title: "Подрядчик",
        children: [
          { key: "0-9-2-1", title: "ННБ" },
          { key: "0-9-2-2", title: "БР" },
          { key: "0-9-2-3", title: "Долота" },
          { key: "0-9-2-4", title: "Пакер" },
          { key: "0-9-2-5", title: "Цементаж" },
          { key: "0-9-2-6", title: "ГИС" },
          { key: "0-9-2-7", title: "КЛИН" },
        ],
      },
    ],
  },
  {
    key: "0-10",
    title: "Подрядчик",
    children: [
      { key: "0-10-1", title: "ННБ" },
      { key: "0-10-2", title: "БР" },
      { key: "0-10-3", title: "Долота" },
      { key: "0-10-4", title: "Пакер" },
      { key: "0-10-5", title: "Цементаж" },
      { key: "0-10-6", title: "ГИС" },
      { key: "0-10-7", title: "КЛИН" },
    ],
  },
  { key: "0-11", title: "Осложнение" },
  {
    key: "0-12",
    title: "Прочее",
    children: [
      { key: "0-12-1", title: "Брак" },
      { key: "0-12-2", title: "Авария" },
      { key: "0-12-3", title: "Метео" },
      { key: "0-12-4", title: "Прочее" },
    ],
  },
];

export const treeSpeed = [
  {
    key: "msp",
    title: "МСП",
  },
  {
    key: "rsp",
    title: "РСП",
  },
  {
    key: "ksp",
    title: "КСП",
  },
];
